
'''     Python 获取最大值函数
以下实例中我们使用max()方法求最大值：

'''

# 1.获取两个数之间的最大值,可以比较字符串(按ascii码值一个一个字符的比较)
print('max(5,3) =',max(5,3))                        # 5
print('max(5.5,3.1425) =',max(5.5,3.1425))          # 5.5
print('max(-5.5,3.1425) =',max(-5.5,3.1425))        # 3.1425
print('max(-5.5,-3.1425) =',max(-5.5,-3.1425))      # -3.1245
print('max(a,b) =',max('a','b'))                    # b
print('max(a,b) =',max('blue','black'))             # black

# 2. 比较元组和列表的元素，

print("max((1,2,3,5,4)) =",max((1,2,3,5,4)))        # 5
print("max([3,5,4]) = ",max([3,5,4]))               # 5
print("max([b,a,b]) = ",max(['b','a','c']))         # c  要求同一类型
print("max([(1,2),(3,3),(2,2)]) = ",max([(1,2),(3,3),(2,2)]))   # (3,3)  要求同一类型
print("max(((1,2),(3,3),(2,2))) = ",max(((1,2),(3,3),(2,2))))   # (3,3)  要求同一类型
print("max(((1,2),(3,3),(2,2))) = ",max(((1,2,5),(3,3),(2,2,1))))   # (3,3)  要求同一类型

# 更多实例
print("max(3,5,4,8,6) = ",max(3,5,4,8,6))   # 8  要求同一类型
print("max(3,5,4,8,6) = ",max("jack","hello",'world','walke','Toms'))   # world  要求同一类型
print("max(3.14,5,4,8,6) = ",max(3.14,5,4,8,6))   # 8  可以比较，全部当做float（float应该是默认数字类型）,
print("max(3,5,4,8,6) = ",max("jack","hello",2,'walke','Toms'))   # world  要求同一类型